In [3]:
%matplotlib inline
from matplotlib import style
style.use('fivethirtyeight')
import matplotlib.pyplot as plt
import datetime
from dateutil.relativedelta import relativedelta
from pandas import DataFrame
from matplotlib.dates import drange
from sqlalchemy import func, and_, create_engine
from sqlalchemy import desc
from sqlalchemy import inspect
from dotenv import load_dotenv
import os

In [4]:
import numpy as np
import pandas as pd
import datetime as dt

In [5]:
#Read csv
csv_file = "Resources/Suburb_house.csv"
suburb_data_df = pd.read_csv(csv_file)
suburb_data_df.head()

,ADDRESS,SUBURB,PRICE,BEDROOMS,BATHROOMS,GARAGE,LAND_AREA,FLOOR_AREA,BUILD_YEAR,CBD_DIST,NEAREST_STN,NEAREST_STN_DIST,DATE_SOLD,POSTCODE,LATITUDE,LONGITUDE,NEAREST_SCH,NEAREST_SCH_DIST,NEAREST_SCH_RANK
0,1 Acorn Place,South Lake,565000,4,2,2.0,600,160,2003.0,18300,Cockburn Central Station,1800,09-2018\r,6164,-32.115900,115.842450,LAKELAND SENIOR HIGH SCHOOL,0.828339,NaN
1,1 Addis Way,Wandi,365000,3,2,2.0,351,139,2013.0,26900,Kwinana Station,4900,02-2019\r,6167,-32.193470,115.859554,ATWELL COLLEGE,5.524324,129.0
2,1 Ainsley Court,Camillo,287000,3,1,1.0,719,86,1979.0,22600,Challis Station,1900,06-2015\r,6111,-32.120578,115.993579,KELMSCOTT SENIOR HIGH SCHOOL,1.649178,113.0
3,1 Albert Street,Bellevue,255000,2,1,2.0,651,59,1953.0,17900,Midland Station,3600,07-2018\r,6056,-31.900547,116.038009,SWAN VIEW SENIOR HIGH SCHOOL,1.571401,NaN
4,1 Aman Place,Lockridge,325000,4,1,2.0,466,131,1998.0,11200,Bassendean Station,2000,11-2016\r,6054,-31.885790,115.947780,KIARA COLLEGE,1.514922,NaN

In [6]:
#Read csv
median_income = pd.read_csv('Resources/G02_median_incomes.csv')
median_income.head()

,POA_CODE_2021,Median_age_persons,Median_mortgage_repay_monthly,Median_tot_prsnl_inc_weekly,Median_rent_weekly,Median_tot_fam_inc_weekly,Average_num_psns_per_bedroom,Median_tot_hhd_inc_weekly,Average_household_size
0,POA6182,0,0,0,0,0,0.0,0,0.0
1,POA6067,33,0,341,150,850,1.9,849,3.0
2,POA6770,29,1800,367,90,794,1.2,1066,3.2
3,POA6718,34,1500,368,150,1006,1.0,1074,2.9
4,POA6765,31,1625,386,100,863,1.1,1226,3.0

In [7]:
#Read csv
csv_path = "Resources/solar_data_by_postcode.csv"

# Import the comic_books_expanded.csv file as a DataFrame
solar_df = pd.read_csv(csv_path, encoding="utf-8")
# Check the special characters imported correctly
print(solar_df.shape)
solar_df.head()

(2805, 45)

,Small Unit Installation Postcode,Previous Years (2001-2020) - Installation Quantity,Previous Years (2001-2020) - SGU Output Rated Output in kW,Jan 2021 - Installations Quantity,Jan 2021 - SGU Rated Output In kW,Feb 2021 - Installations Quantity,Feb 2021 - SGU Rated Output In kW,Mar 2021 - Installations Quantity,Mar 2021 - SGU Rated Output In kW,Apr 2021 - Installations Quantity,...,May 2022 - Installations Quantity,May 2022 - SGU Rated Output in kW,June 2022 - Installations Quantity,June 2022 - SGU Rated Output in kW,July 2022 - Installations Quantity,July 2022 - SGU Rated Output in kW,August 2022 - Installations Quantity,August 2022 - SGU Rated Output in kW,Installations Quantity Total,SGU Rated Output In kW Total
0,3029,13028,66465.309,256,1839.165,219,1479.605,332,2818.100,275,...,112,965,136,1080.890,151,1139.205,76,574.530,17462,100848.824
1,4670,15863,72687.831,93,736.475,114,1101.585,163,1207.370,152,...,110,784,125,946.100,106,899.985,100,851.105,18377,93007.584
2,4740,10650,61880.971,85,696.975,111,1046.835,134,1265.560,97,...,95,775,114,1111.945,96,827.535,89,824.265,12851,82339.621
3,4655,14573,62724.539,91,686.790,128,1014.805,154,1096.095,144,...,100,707,105,727.355,127,859.325,96,691.580,16942,80543.969
4,4350,12326,61933.825,118,863.025,127,991.905,122,998.090,128,...,69,681,99,884.020,88,834.495,81,720.355,14370,79208.120

In [8]:
# Make a reference to the australian_postcodes_loc.csv file path
csv_path = "Resources/australian_postcodes_loc.csv"

# Import the australian_postcodes_loc.csv file as a DataFrame
postcode_raw_df = pd.read_csv(csv_path, encoding="utf-8")
# Check the csv imported correctly
print(postcode_raw_df.shape)
postcode_raw_df.head()

(18442, 8)

,id,Postcodes,locality,state,lat,long,Lat_precise,Long_precise
0,1,200,ANU,ACT,-35.277700,149.11900,-35.277700,149.119000
1,2,200,Australian National University,ACT,-35.277700,149.11890,-35.277700,149.118527
2,3,800,DARWIN,NT,-12.458684,130.83668,-12.393279,130.776661
3,4,800,DARWIN CITY,NT,-12.458684,130.83668,-12.393279,130.776661
4,5,801,DARWIN,NT,-12.458684,130.83668,-12.463440,130.845642

In [10]:
load_dotenv()
protocol = 'postgresql'
username = os.environ.get('db_UserName')
password = os.environ.get('db_Password')
host = 'localhost'
port = 5432
database_name = 'Project_2'
rds_connection_string = f'{protocol}://{username}:{password}@{host}:{port}/{database_name}'
engine = create_engine(rds_connection_string)
insp = inspect(engine)

In [11]:
#Part 1
house_prices_df = suburb_data_df[["SUBURB","PRICE","BEDROOMS",	"BATHROOMS",	"GARAGE",	"LAND_AREA",	"FLOOR_AREA",	"CBD_DIST",	"NEAREST_STN_DIST",	"DATE_SOLD",	"NEAREST_SCH_DIST"]].copy()
house_prices_df.head()

,SUBURB,PRICE,BEDROOMS,BATHROOMS,GARAGE,LAND_AREA,FLOOR_AREA,CBD_DIST,NEAREST_STN_DIST,DATE_SOLD,NEAREST_SCH_DIST
0,South Lake,565000,4,2,2.0,600,160,18300,1800,09-2018\r,0.828339
1,Wandi,365000,3,2,2.0,351,139,26900,4900,02-2019\r,5.524324
2,Camillo,287000,3,1,1.0,719,86,22600,1900,06-2015\r,1.649178
3,Bellevue,255000,2,1,2.0,651,59,17900,3600,07-2018\r,1.571401
4,Lockridge,325000,4,1,2.0,466,131,11200,2000,11-2016\r,1.514922

In [12]:
house_prices_df.columns= house_prices_df.columns.str.lower()
house_prices_df.head()

,suburb,price,bedrooms,bathrooms,garage,land_area,floor_area,cbd_dist,nearest_stn_dist,date_sold,nearest_sch_dist
0,South Lake,565000,4,2,2.0,600,160,18300,1800,09-2018\r,0.828339
1,Wandi,365000,3,2,2.0,351,139,26900,4900,02-2019\r,5.524324
2,Camillo,287000,3,1,1.0,719,86,22600,1900,06-2015\r,1.649178
3,Bellevue,255000,2,1,2.0,651,59,17900,3600,07-2018\r,1.571401
4,Lockridge,325000,4,1,2.0,466,131,11200,2000,11-2016\r,1.514922

In [13]:
 insp.get_table_names()

['house_prices',
 'solar_metadata_waonly',
 'Median Income',
 'postcode_metadata_waonly']

In [14]:
suburb_output ='Output/suburb_prices.csv'

house_prices_df.to_csv(suburb_output,header=True,index=True)

In [15]:
house_prices_df.to_sql(name='house_prices', con=engine, if_exists='append', index=False)

656

In [16]:
#Part 2
solar_post_codes = solar_df["Small Unit Installation Postcode"]
solar_post_codes.describe

<bound method NDFrame.describe of 0       3029
1       4670
2       4740
3       4655
4       4350
        ...
2800    9729
2801    2552
2802    6013
2803    5175
2804     200
Name: Small Unit Installation Postcode, Length: 2805, dtype: int64>

In [17]:
solar_install_qty_sum = solar_df.iloc[:,[1,3,5,7,9,11,13,15,17]].sum(axis=1)
solar_install_qty_sum

0       15301
1       16913
2       11575
3       15606
4       13299
        ...
2800        1
2801        1
2802        1
2803        1
2804        1
Length: 2805, dtype: int64

In [18]:
solar_install_kw_sum = solar_df.iloc[:,[2,4,6,8,10,12,14,16,18]].sum(axis=1)
solar_install_kw_sum

0       83278.689
1       81394.776
2       70111.561
3       70298.821
4       69938.410
          ...
2800        0.875
2801        0.560
2802        0.375
2803        0.300
2804        0.080
Length: 2805, dtype: float64

In [19]:
solar_metadata_df = pd.DataFrame({"post_code": solar_post_codes,
                            "installation_qty": solar_install_qty_sum,
                            "rated_output": solar_install_kw_sum}) 
solar_metadata_df .head()

   post_code  installation_qty  rated_output
0       3029             15301     83278.689
1       4670             16913     81394.776
2       4740             11575     70111.561
3       4655             15606     70298.821
4       4350             13299     69938.410

In [20]:
solar_metadata_WAonly_df = solar_metadata_df[(solar_metadata_df["post_code"] >= 6000) &
                            (solar_metadata_df["post_code"] < 7000)]

solar_metadata_WAonly_df

      post_code  installation_qty  rated_output
7          6065             13518     66718.494
9          6210             16674     65212.286
13         6112             12546     59646.184
17         6164             11794     54486.607
24         6155             10586     48655.097
...         ...               ...           ...
2780       6902                 1         2.280
2782       6956                 1         1.670
2789       6913                 1         1.500
2798       6643                 1         0.960
2802       6013                 1         0.375

[445 rows x 3 columns]

In [21]:
solar_metadata_WAonly_df = solar_metadata_WAonly_df.sort_values("post_code")
solar_metadata_WAonly_df = solar_metadata_WAonly_df.reset_index(drop=True)
solar_metadata_WAonly_df

     post_code  installation_qty  rated_output
0         6000               461      3839.878
1         6001                 3         9.340
2         6003               141       992.489
3         6004               171      1512.724
4         6005               154      2626.344
..         ...               ...           ...
440       6988                 3         4.780
441       6989                 2         6.520
442       6990                 4        12.520
443       6991                 6        15.370
444       6992                 7        19.010

[445 rows x 3 columns]

In [22]:
# Push cleaned DataFrame to a new CSV file
solar_metadata_WAonly_df.to_csv("Output/solar_metadata_WAonly_df.csv",
                  encoding="utf-8", index=False, header=True)

In [23]:
solar_metadata_WAonly_df.to_sql(name='solar_metadata_waonly', con=engine, if_exists='append', index=False)

445

In [24]:
# Reorganising the columns using double brackets
postcode_raw_df1 = postcode_raw_df[["Postcodes","locality","state","Lat_precise", "Long_precise"]]
postcode_raw_df1.head()

   Postcodes                        locality state  Lat_precise  Long_precise
0        200                             ANU   ACT   -35.277700    149.119000
1        200  Australian National University   ACT   -35.277700    149.118527
2        800                          DARWIN    NT   -12.393279    130.776661
3        800                     DARWIN CITY    NT   -12.393279    130.776661
4        801                          DARWIN    NT   -12.463440    130.845642

In [25]:
# Rename columns for readability
postcode_df = postcode_raw_df1.rename(columns={"Postcodes" : "post_code",
                                                "locality": "suburb",
                                                "Lat_precise" : "lat",
                                                "Long_precise" : "long"})
postcode_df.head()

   post_code                          suburb state        lat        long
0        200                             ANU   ACT -35.277700  149.119000
1        200  Australian National University   ACT -35.277700  149.118527
2        800                          DARWIN    NT -12.393279  130.776661
3        800                     DARWIN CITY    NT -12.393279  130.776661
4        801                          DARWIN    NT -12.463440  130.845642

In [26]:
# Filter down to WA only
postcode_metadata_WAonly_df = postcode_df[(postcode_df["post_code"] >= 6000) &
                            (postcode_df["post_code"] < 7000)]

postcode_metadata_WAonly_df

       post_code                suburb state        lat        long
15675       6000  CITY DELIVERY CENTRE    WA -31.955000  115.855000
15676       6000                 PERTH    WA -31.952574  115.861049
15677       6000             PERTH GPO    WA -31.951300  115.859000
15678       6001                 PERTH    WA -31.950527  115.860457
15679       6003              HIGHGATE    WA -31.939219  115.869157
...          ...                   ...   ...        ...         ...
17590       6989            MADDINGTON    WA -32.050286  115.984493
17591       6990              GOSNELLS    WA -32.082302  115.990267
17592       6991             KELMSCOTT    WA -32.114400  116.015000
17593       6992              ARMADALE    WA -32.147301  116.012876
17594       6997          KELMSCOTT DC    WA -32.129900  116.007000

[1920 rows x 5 columns]

In [27]:
# Add unique index + sort 
postcode_metadata_WAonly_df = postcode_metadata_WAonly_df.sort_values("post_code")
postcode_metadata_WAonly_df = postcode_metadata_WAonly_df.reset_index(drop=True)
postcode_metadata_WAonly_df = postcode_metadata_WAonly_df.reset_index()
postcode_metadata_WAonly_df

      index  post_code                suburb state        lat        long
0         0       6000  CITY DELIVERY CENTRE    WA -31.955000  115.855000
1         1       6000                 PERTH    WA -31.952574  115.861049
2         2       6000             PERTH GPO    WA -31.951300  115.859000
3         3       6001                 PERTH    WA -31.950527  115.860457
4         4       6003              HIGHGATE    WA -31.939219  115.869157
...     ...        ...                   ...   ...        ...         ...
1915   1915       6989            MADDINGTON    WA -32.050286  115.984493
1916   1916       6990              GOSNELLS    WA -32.082302  115.990267
1917   1917       6991             KELMSCOTT    WA -32.114400  116.015000
1918   1918       6992              ARMADALE    WA -32.147301  116.012876
1919   1919       6997          KELMSCOTT DC    WA -32.129900  116.007000

[1920 rows x 6 columns]

In [28]:
# Push cleaned DataFrame to a new CSV file
postcode_metadata_WAonly_df.to_csv("Output/postcode_metadata_WAonly_df.csv",
                  encoding="utf-8", index=False, header=True)

In [29]:
postcode_metadata_WAonly_df.to_sql(name='postcode_metadata_waonly', con=engine, if_exists='append', index=False)

920

In [30]:
#Part 3
list(median_income.columns)

['POA_CODE_2021',
 'Median_age_persons',
 'Median_mortgage_repay_monthly',
 'Median_tot_prsnl_inc_weekly',
 'Median_rent_weekly',
 'Median_tot_fam_inc_weekly',
 'Average_num_psns_per_bedroom',
 'Median_tot_hhd_inc_weekly',
 'Average_household_size']

In [31]:
# Remove superflus columns for median income
median_income = median_income[['POA_CODE_2021',
 'Median_age_persons',
 'Median_tot_prsnl_inc_weekly',
 'Median_tot_fam_inc_weekly',
 'Median_tot_hhd_inc_weekly']]
median_income.head()

,POA_CODE_2021,Median_age_persons,Median_tot_prsnl_inc_weekly,Median_tot_fam_inc_weekly,Median_tot_hhd_inc_weekly
0,POA6182,0,0,0,0
1,POA6067,33,341,850,849
2,POA6770,29,367,794,1066
3,POA6718,34,368,1006,1074
4,POA6765,31,386,863,1226

In [32]:
# Load csv with ABS data for income by hourshold composition
household_income = pd.read_csv('Resources/G33_household_income.csv')
household_income.head()

,POA_CODE_2021,Neg_Nil_inc_fam_households,Neg_Nil_inc_Non_fam_househlds,Negative_Nil_income_Tot,HI_1_149_Family_households,HI_1_149_Non_family_hseholds,HI_1_149_Tot,HI_150_299_Family_households,HI_150_299_Non_fam_househlds,HI_150_299_Tot,...,HI_4000_more_Tot,Part_inc_stated_Fam_household,Part_inc_std_Non_fam_hhds,Partial_income_stated_Tot,All_incomes_ns_Famly_househld,All_inc_ns_Non_famly_househld,All_incomes_not_stated_Tot,Tot_Family_households,Tot_Non_family_households,Tot_Tot
0,POA6000,47,129,181,6,29,34,7,63,74,...,873,245,109,352,16,38,57,2755,3305,6064
1,POA6003,7,32,37,0,5,11,0,27,31,...,205,74,37,112,4,11,21,790,933,1724
2,POA6004,47,116,161,10,20,26,16,60,77,...,941,217,92,312,11,34,49,2817,2748,5564
3,POA6005,16,44,66,4,15,19,8,45,51,...,491,93,56,152,3,28,31,1287,1661,2949
4,POA6006,21,42,60,3,17,22,6,35,38,...,948,149,66,214,14,21,36,2398,1483,3883

In [33]:
# Review columns for relevance
list(household_income.columns)

['POA_CODE_2021',
 'Neg_Nil_inc_fam_households',
 'Neg_Nil_inc_Non_fam_househlds',
 'Negative_Nil_income_Tot',
 'HI_1_149_Family_households',
 'HI_1_149_Non_family_hseholds',
 'HI_1_149_Tot',
 'HI_150_299_Family_households',
 'HI_150_299_Non_fam_househlds',
 'HI_150_299_Tot',
 'HI_300_399_Family_households',
 'HI_300_399_Non_fam_househlds',
 'HI_300_399_Tot',
 'HI_400_499_Family_households',
 'HI_400_499_Non_fam_househlds',
 'HI_400_499_Tot',
 'HI_500_649_Family_households',
 'HI_500_649_Non_fam_househlds',
 'HI_500_649_Tot',
 'HI_650_799_Family_households',
 'HI_650_799_Non_fam_househlds',
 'HI_650_799_Tot',
 'HI_800_999_Fam_households',
 'HI_800_999_Non_fam_hsehlds',
 'HI_800_999_Tot',
 'HI_1000_1249_Fam_households',
 'HI_1000_1249_Non_fam_hsehlds',
 'HI_1000_1249_Tot',
 'HI_1250_1499_Fam_households',
 'HI_1250_1499_Non_fam_hsehlds',
 'HI_1250_1499_Tot',
 'HI_1500_1749_Fam_households',
 'HI_1500_1749_Non_fam_hsehlds',
 'HI_1500_1749_Tot',
 'HI_1750_1999_Fam_households',
 'HI_1750_1999_Non_fam_hsehlds',
 'HI_1750_1999_Tot',
 'HI_2000_2499_Fam_households',
 'HI_2000_2499_Non_fam_hsehlds',
 'HI_2000_2499_Tot',
 'HI_2500_2999_Fam_households',
 'HI_2500_2999_Non_fam_hsehlds',
 'HI_2500_2999_Tot',
 'HI_3000_3499_Fam_households',
 'HI_3000_3499_Non_fam_hsehlds',
 'HI_3000_3499_Tot',
 'HI_3500_3999_Fam_households',
 'HI_3500_3999_Non_fam_hsehlds',
 'HI_3500_3999_Tot',
 'HI_4000_more_Fam_households',
 'HI_4000_more_Non_fam_hsehlds',
 'HI_4000_more_Tot',
 'Part_inc_stated_Fam_household',
 'Part_inc_std_Non_fam_hhds',
 'Partial_income_stated_Tot',
 'All_incomes_ns_Famly_househld',
 'All_inc_ns_Non_famly_househld',
 'All_incomes_not_stated_Tot',
 'Tot_Family_households',
 'Tot_Non_family_households',
 'Tot_Tot']

In [34]:
# Remove superflus columns for household income
household_income = household_income[['POA_CODE_2021',
 'Negative_Nil_income_Tot',
 'HI_1_149_Tot',
 'HI_150_299_Tot',
 'HI_300_399_Tot',
 'HI_400_499_Tot',
 'HI_500_649_Tot',
 'HI_650_799_Tot',
 'HI_800_999_Tot',
 'HI_1000_1249_Tot',
 'HI_1250_1499_Tot',
 'HI_1500_1749_Tot',
 'HI_1750_1999_Tot',
 'HI_2000_2499_Tot',
 'HI_2500_2999_Tot',
 'HI_3000_3499_Tot',
 'HI_3500_3999_Tot',
 'HI_4000_more_Tot',
 'Partial_income_stated_Tot',
 'All_incomes_not_stated_Tot',
 'Tot_Family_households',
 'Tot_Non_family_households']]
household_income.head()

,POA_CODE_2021,Negative_Nil_income_Tot,HI_1_149_Tot,HI_150_299_Tot,HI_300_399_Tot,HI_400_499_Tot,HI_500_649_Tot,HI_650_799_Tot,HI_800_999_Tot,HI_1000_1249_Tot,...,HI_1750_1999_Tot,HI_2000_2499_Tot,HI_2500_2999_Tot,HI_3000_3499_Tot,HI_3500_3999_Tot,HI_4000_more_Tot,Partial_income_stated_Tot,All_incomes_not_stated_Tot,Tot_Family_households,Tot_Non_family_households
0,POA6000,181,34,74,143,183,180,209,285,385,...,414,902,330,432,221,873,352,57,2755,3305
1,POA6003,37,11,31,44,72,52,54,80,130,...,120,219,128,111,59,205,112,21,790,933
2,POA6004,161,26,77,119,197,169,173,229,358,...,330,776,304,400,183,941,312,49,2817,2748
3,POA6005,66,19,51,94,110,107,100,153,162,...,194,361,158,200,112,491,152,31,1287,1661
4,POA6006,60,22,38,95,152,131,140,154,209,...,169,416,259,282,182,948,214,36,2398,1483

In [35]:
# Load csv with ABS data for individual income
individual_incomeA = pd.read_csv('Resources/2021Census_G17A_WA_POA.csv')
individual_incomeB = pd.read_csv('Resources/2021Census_G17B_WA_POA.csv')
individual_incomeC = pd.read_csv('Resources/2021Census_G17C_WA_POA.csv')
# Merge the three individual income CSVs

individual_income = pd.merge(individual_incomeA,individual_incomeB,on="POA_CODE_2021")
individual_income = pd.merge(individual_income,individual_incomeC,on="POA_CODE_2021")
individual_income.head()

,POA_CODE_2021,M_Neg_Nil_income_15_19_yrs,M_Neg_Nil_income_20_24_yrs,M_Neg_Nil_income_25_34_yrs,M_Neg_Nil_income_35_44_yrs,M_Neg_Nil_income_45_54_yrs,M_Neg_Nil_income_55_64_yrs,M_Neg_Nil_income_65_74_yrs,M_Neg_Nil_income_75_84_yrs,M_Negtve_Nil_incme_85_yrs_ovr,...,P_Tot_15_19_yrs,P_Tot_20_24_yrs,P_Tot_25_34_yrs,P_Tot_35_44_yrs,P_Tot_45_54_yrs,P_Tot_55_64_yrs,P_Tot_65_74_yrs,P_Tot_75_84_yrs,P_Tot_85ov,P_Tot_Tot
0,POA6000,54,106,95,39,27,36,30,6,3,...,315,1643,4789,2596,1363,1116,682,272,83,12861
1,POA6003,11,11,11,3,0,4,4,0,0,...,67,357,1337,647,361,298,200,80,22,3372
2,POA6004,41,53,57,35,28,34,36,14,4,...,241,988,3449,2106,1319,1292,964,352,98,10809
3,POA6005,14,18,27,23,13,12,14,9,3,...,104,471,1927,1171,599,562,415,263,108,5618
4,POA6006,89,16,15,21,14,13,23,9,9,...,378,619,1734,1578,1258,1163,755,405,250,8130

In [36]:
# Review columns for relevance
list(individual_income.columns)

['POA_CODE_2021',
 'M_Neg_Nil_income_15_19_yrs',
 'M_Neg_Nil_income_20_24_yrs',
 'M_Neg_Nil_income_25_34_yrs',
 'M_Neg_Nil_income_35_44_yrs',
 'M_Neg_Nil_income_45_54_yrs',
 'M_Neg_Nil_income_55_64_yrs',
 'M_Neg_Nil_income_65_74_yrs',
 'M_Neg_Nil_income_75_84_yrs',
 'M_Negtve_Nil_incme_85_yrs_ovr',
 'M_Neg_Nil_income_Tot',
 'M_1_149_15_19_yrs',
 'M_1_149_20_24_yrs',
 'M_1_149_25_34_yrs',
 'M_1_149_35_44_yrs',
 'M_1_149_45_54_yrs',
 'M_1_149_55_64_yrs',
 'M_1_149_65_74_yrs',
 'M_1_149_75_84_yrs',
 'M_1_149_85ov',
 'M_1_149_Tot',
 'M_150_299_15_19_yrs',
 'M_150_299_20_24_yrs',
 'M_150_299_25_34_yrs',
 'M_150_299_35_44_yrs',
 'M_150_299_45_54_yrs',
 'M_150_299_55_64_yrs',
 'M_150_299_65_74_yrs',
 'M_150_299_75_84_yrs',
 'M_150_299_85ov',
 'M_150_299_Tot',
 'M_300_399_15_19_yrs',
 'M_300_399_20_24_yrs',
 'M_300_399_25_34_yrs',
 'M_300_399_35_44_yrs',
 'M_300_399_45_54_yrs',
 'M_300_399_55_64_yrs',
 'M_300_399_65_74_yrs',
 'M_300_399_75_84_yrs',
 'M_300_399_85ov',
 'M_300_399_Tot',
 'M_400_499_15_19_yrs',
 'M_400_499_20_24_yrs',
 'M_400_499_25_34_yrs',
 'M_400_499_35_44_yrs',
 'M_400_499_45_54_yrs',
 'M_400_499_55_64_yrs',
 'M_400_499_65_74_yrs',
 'M_400_499_75_84_yrs',
 'M_400_499_85ov',
 'M_400_499_Tot',
 'M_500_649_15_19_yrs',
 'M_500_649_20_24_yrs',
 'M_500_649_25_34_yrs',
 'M_500_649_35_44_yrs',
 'M_500_649_45_54_yrs',
 'M_500_649_55_64_yrs',
 'M_500_649_65_74_yrs',
 'M_500_649_75_84_yrs',
 'M_500_649_85ov',
 'M_500_649_Tot',
 'M_650_799_15_19_yrs',
 'M_650_799_20_24_yrs',
 'M_650_799_25_34_yrs',
 'M_650_799_35_44_yrs',
 'M_650_799_45_54_yrs',
 'M_650_799_55_64_yrs',
 'M_650_799_65_74_yrs',
 'M_650_799_75_84_yrs',
 'M_650_799_85ov',
 'M_650_799_Tot',
 'M_800_999_15_19_yrs',
 'M_800_999_20_24_yrs',
 'M_800_999_25_34_yrs',
 'M_800_999_35_44_yrs',
 'M_800_999_45_54_yrs',
 'M_800_999_55_64_yrs',
 'M_800_999_65_74_yrs',
 'M_800_999_75_84_yrs',
 'M_800_999_85ov',
 'M_800_999_Tot',
 'M_1000_1249_15_19_yrs',
 'M_1000_1249_20_24_yrs',
 'M_1000_1249_25_34_yrs',
 'M_1000_1249_35_44_yrs',
 'M_1000_1249_45_54_yrs',
 'M_1000_1249_55_64_yrs',
 'M_1000_1249_65_74_yrs',
 'M_1000_1249_75_84_yrs',
 'M_1000_1249_85ov',
 'M_1000_1249_Tot',
 'M_1250_1499_15_19_yrs',
 'M_1250_1499_20_24_yrs',
 'M_1250_1499_25_34_yrs',
 'M_1250_1499_35_44_yrs',
 'M_1250_1499_45_54_yrs',
 'M_1250_1499_55_64_yrs',
 'M_1250_1499_65_74_yrs',
 'M_1250_1499_75_84_yrs',
 'M_1250_1499_85ov',
 'M_1250_1499_Tot',
 'M_1500_1749_15_19_yrs',
 'M_1500_1749_20_24_yrs',
 'M_1500_1749_25_34_yrs',
 'M_1500_1749_35_44_yrs',
 'M_1500_1749_45_54_yrs',
 'M_1500_1749_55_64_yrs',
 'M_1500_1749_65_74_yrs',
 'M_1500_1749_75_84_yrs',
 'M_1500_1749_85ov',
 'M_1500_1749_Tot',
 'M_1750_1999_15_19_yrs',
 'M_1750_1999_20_24_yrs',
 'M_1750_1999_25_34_yrs',
 'M_1750_1999_35_44_yrs',
 'M_1750_1999_45_54_yrs',
 'M_1750_1999_55_64_yrs',
 'M_1750_1999_65_74_yrs',
 'M_1750_1999_75_84_yrs',
 'M_1750_1999_85ov',
 'M_1750_1999_Tot',
 'M_2000_2999_15_19_yrs',
 'M_2000_2999_20_24_yrs',
 'M_2000_2999_25_34_yrs',
 'M_2000_2999_35_44_yrs',
 'M_2000_2999_45_54_yrs',
 'M_2000_2999_55_64_yrs',
 'M_2000_2999_65_74_yrs',
 'M_2000_2999_75_84_yrs',
 'M_2000_2999_85ov',
 'M_2000_2999_Tot',
 'M_3000_3499_15_19_yrs',
 'M_3000_3499_20_24_yrs',
 'M_3000_3499_25_34_yrs',
 'M_3000_3499_35_44_yrs',
 'M_3000_3499_45_54_yrs',
 'M_3000_3499_55_64_yrs',
 'M_3000_3499_65_74_yrs',
 'M_3000_3499_75_84_yrs',
 'M_3000_3499_85ov',
 'M_3000_3499_Tot',
 'M_3500_more_15_19_yrs',
 'M_3500_more_20_24_yrs',
 'M_3500_more_25_34_yrs',
 'M_3500_more_35_44_yrs',
 'M_3500_more_45_54_yrs',
 'M_3500_more_55_64_yrs',
 'M_3500_more_65_74_yrs',
 'M_3500_more_75_84_yrs',
 'M_3500_more_85ov',
 'M_3500_more_Tot',
 'M_PI_NS_15_19_yrs',
 'M_PI_NS_ns_20_24_yrs',
 'M_PI_NS_ns_25_34_yrs',
 'M_PI_NS_ns_35_44_yrs',
 'M_PI_NS_ns_45_54_yrs',
 'M_PI_NS_ns_55_64_yrs',
 'M_PI_NS_ns_65_74_yrs',
 'M_PI_NS_ns_75_84_yrs',
 'M_PI_NS_ns_85_yrs_ovr',
 'M_PI_NS_ns_Tot',
 'M_Tot_15_19_yrs',
 'M_Tot_20_24_yrs',
 'M_Tot_25_34_yrs',
 'M_Tot_35_44_yrs',
 'M_Tot_45_54_yrs',
 'M_Tot_55_64_yrs',
 'M_Tot_65_74_yrs',
 'M_Tot_75_84_yrs',
 'M_Tot_85ov',
 'M_Tot_Tot',
 'F_Neg_Nil_income_15_19_yrs',
 'F_Neg_Nil_income_20_24_yrs',
 'F_Neg_Nil_income_25_34_yrs',
 'F_Neg_Nil_income_35_44_yrs',
 'F_Neg_Nil_income_45_54_yrs',
 'F_Neg_Nil_income_55_64_yrs',
 'F_Neg_Nil_income_65_74_yrs',
 'F_Neg_Nil_income_75_84_yrs',
 'F_Neg_Nil_incme_85_yrs_ovr',
 'F_Neg_Nil_income_Tot',
 'F_1_149_15_19_yrs',
 'F_1_149_20_24_yrs',
 'F_1_149_25_34_yrs',
 'F_1_149_35_44_yrs',
 'F_1_149_45_54_yrs',
 'F_1_149_55_64_yrs',
 'F_1_149_65_74_yrs',
 'F_1_149_75_84_yrs',
 'F_1_149_85ov',
 'F_1_149_Tot',
 'F_150_299_15_19_yrs',
 'F_150_299_20_24_yrs',
 'F_150_299_25_34_yrs',
 'F_150_299_35_44_yrs',
 'F_150_299_45_54_yrs',
 'F_150_299_55_64_yrs',
 'F_150_299_65_74_yrs',
 'F_150_299_75_84_yrs',
 'F_150_299_85ov',
 'F_150_299_Tot',
 'F_300_399_15_19_yrs',
 'F_300_399_20_24_yrs',
 'F_300_399_25_34_yrs',
 'F_300_399_35_44_yrs',
 'F_300_399_45_54_yrs',
 'F_300_399_55_64_yrs',
 'F_300_399_65_74_yrs',
 'F_300_399_75_84_yrs',
 'F_300_399_85ov',
 'F_300_399_Tot',
 'F_400_499_15_19_yrs',
 'F_400_499_20_24_yrs',
 'F_400_499_25_34_yrs',
 'F_400_499_35_44_yrs',
 'F_400_499_45_54_yrs',
 'F_400_499_55_64_yrs',
 'F_400_499_65_74_yrs',
 'F_400_499_75_84_yrs',
 'F_400_499_85ov',
 'F_400_499_Tot',
 'F_500_649_15_19_yrs',
 'F_500_649_20_24_yrs',
 'F_500_649_25_34_yrs',
 'F_500_649_35_44_yrs',
 'F_500_649_45_54_yrs',
 'F_500_649_55_64_yrs',
 'F_500_649_65_74_yrs',
 'F_500_649_75_84_yrs',
 'F_500_649_85ov',
 'F_500_649_Tot',
 'F_650_799_15_19_yrs',
 'F_650_799_20_24_yrs',
 'F_650_799_25_34_yrs',
 'F_650_799_35_44_yrs',
 'F_650_799_45_54_yrs',
 'F_650_799_55_64_yrs',
 'F_650_799_65_74_yrs',
 'F_650_799_75_84_yrs',
 'F_650_799_85ov',
 'F_650_799_Tot',
 'F_800_999_15_19_yrs',
 'F_800_999_20_24_yrs',
 'F_800_999_25_34_yrs',
 'F_800_999_35_44_yrs',
 'F_800_999_45_54_yrs',
 'F_800_999_55_64_yrs',
 'F_800_999_65_74_yrs',
 'F_800_999_75_84_yrs',
 'F_800_999_85ov',
 'F_800_999_Tot',
 'F_1000_1249_15_19_yrs',
 'F_1000_1249_20_24_yrs',
 'F_1000_1249_25_34_yrs',
 'F_1000_1249_35_44_yrs',
 'F_1000_1249_45_54_yrs',
 'F_1000_1249_55_64_yrs',
 'F_1000_1249_65_74_yrs',
 'F_1000_1249_75_84_yrs',
 'F_1000_1249_85ov',
 'F_1000_1249_Tot',
 'F_1250_1499_15_19_yrs',
 'F_1250_1499_20_24_yrs',
 'F_1250_1499_25_34_yrs',
 'F_1250_1499_35_44_yrs',
 'F_1250_1499_45_54_yrs',
 'F_1250_1499_55_64_yrs',
 'F_1250_1499_65_74_yrs',
 'F_1250_1499_75_84_yrs',
 'F_1250_1499_85ov',
 'F_1250_1499_Tot',
 'F_1500_1749_15_19_yrs',
 'F_1500_1749_20_24_yrs',
 'F_1500_1749_25_34_yrs',
 'F_1500_1749_35_44_yrs',
 'F_1500_1749_45_54_yrs',
 'F_1500_1749_55_64_yrs',
 'F_1500_1749_65_74_yrs',
 'F_1500_1749_75_84_yrs',
 'F_1500_1749_85ov',
 'F_1500_1749_Tot',
 'F_1750_1999_15_19_yrs',
 'F_1750_1999_20_24_yrs',
 'F_1750_1999_25_34_yrs',
 'F_1750_1999_35_44_yrs',
 'F_1750_1999_45_54_yrs',
 'F_1750_1999_55_64_yrs',
 'F_1750_1999_65_74_yrs',
 'F_1750_1999_75_84_yrs',
 'F_1750_1999_85ov',
 'F_1750_1999_Tot',
 'F_2000_2999_15_19_yrs',
 'F_2000_2999_20_24_yrs',
 'F_2000_2999_25_34_yrs',
 'F_2000_2999_35_44_yrs',
 'F_2000_2999_45_54_yrs',
 'F_2000_2999_55_64_yrs',
 'F_2000_2999_65_74_yrs',
 'F_2000_2999_75_84_yrs',
 'F_2000_2999_85ov',
 'F_2000_2999_Tot',
 'F_3000_3499_15_19_yrs',
 'F_3000_3499_20_24_yrs',
 'F_3000_3499_25_34_yrs',
 'F_3000_3499_35_44_yrs',
 'F_3000_3499_45_54_yrs',
 'F_3000_3499_55_64_yrs',
 'F_3000_3499_65_74_yrs',
 'F_3000_3499_75_84_yrs',
 'F_3000_3499_85ov',
 'F_3000_3499_Tot',
 'F_3500_more_15_19_yrs',
 'F_3500_more_20_24_yrs',
 'F_3500_more_25_34_yrs',
 'F_3500_more_35_44_yrs',
 'F_3500_more_45_54_yrs',
 'F_3500_more_55_64_yrs',
 'F_3500_more_65_74_yrs',
 'F_3500_more_75_84_yrs',
 'F_3500_more_85ov',
 'F_3500_more_Tot',
 'F_PI_NS_15_19_yrs',
 'F_PI_NS_ns_20_24_yrs',
 'F_PI_NS_ns_25_34_yrs',
 'F_PI_NS_ns_35_44_yrs',
 'F_PI_NS_ns_45_54_yrs',
 'F_PI_NS_ns_55_64_yrs',
 'F_PI_NS_ns_65_74_yrs',
 'F_PI_NS_ns_75_84_yrs',
 'F_PI_NS_ns_85_yrs_ovr',
 'F_PI_NS_ns_Tot',
 'F_Tot_15_19_yrs',
 'F_Tot_20_24_yrs',
 'F_Tot_25_34_yrs',
 'F_Tot_35_44_yrs',
 'F_Tot_45_54_yrs',
 'F_Tot_55_64_yrs',
 'F_Tot_65_74_yrs',
 'F_Tot_75_84_yrs',
 'F_Tot_85ov',
 'F_Tot_Tot',
 'P_Neg_Nil_income_15_19_yrs',
 'P_Neg_Nil_income_20_24_yrs',
 'P_Neg_Nil_income_25_34_yrs',
 'P_Neg_Nil_income_35_44_yrs',
 'P_Neg_Nil_income_45_54_yrs',
 'P_Neg_Nil_income_55_64_yrs',
 'P_Neg_Nil_income_65_74_yrs',
 'P_Neg_Nil_income_75_84_yrs',
 'P_Negtve_Nil_incme_85_yrs_ovr',
 'P_Neg_Nil_income_Tot',
 'P_1_149_15_19_yrs',
 'P_1_149_20_24_yrs',
 'P_1_149_25_34_yrs',
 'P_1_149_35_44_yrs',
 'P_1_149_45_54_yrs',
 'P_1_149_55_64_yrs',
 'P_1_149_65_74_yrs',
 'P_1_149_75_84_yrs',
 'P_1_149_85ov',
 'P_1_149_Tot',
 'P_150_299_15_19_yrs',
 'P_150_299_20_24_yrs',
 'P_150_299_25_34_yrs',
 'P_150_299_35_44_yrs',
 'P_150_299_45_54_yrs',
 'P_150_299_55_64_yrs',
 'P_150_299_65_74_yrs',
 'P_150_299_75_84_yrs',
 'P_150_299_85ov',
 'P_150_299_Tot',
 'P_300_399_15_19_yrs',
 'P_300_399_20_24_yrs',
 'P_300_399_25_34_yrs',
 'P_300_399_35_44_yrs',
 'P_300_399_45_54_yrs',
 'P_300_399_55_64_yrs',
 'P_300_399_65_74_yrs',
 'P_300_399_75_84_yrs',
 'P_300_399_85ov',
 'P_300_399_Tot',
 'P_400_499_15_19_yrs',
 'P_400_499_20_24_yrs',
 'P_400_499_25_34_yrs',
 'P_400_499_35_44_yrs',
 'P_400_499_45_54_yrs',
 'P_400_499_55_64_yrs',
 'P_400_499_65_74_yrs',
 'P_400_499_75_84_yrs',
 'P_400_499_85ov',
 'P_400_499_Tot',
 'P_500_649_15_19_yrs',
 'P_500_649_20_24_yrs',
 'P_500_649_25_34_yrs',
 'P_500_649_35_44_yrs',
 'P_500_649_45_54_yrs',
 'P_500_649_55_64_yrs',
 'P_500_649_65_74_yrs',
 'P_500_649_75_84_yrs',
 'P_500_649_85ov',
 'P_500_649_Tot',
 'P_650_799_15_19_yrs',
 'P_650_799_20_24_yrs',
 'P_650_799_25_34_yrs',
 'P_650_799_35_44_yrs',
 'P_650_799_45_54_yrs',
 'P_650_799_55_64_yrs',
 'P_650_799_65_74_yrs',
 'P_650_799_75_84_yrs',
 'P_650_799_85ov',
 'P_650_799_Tot',
 'P_800_999_15_19_yrs',
 'P_800_999_20_24_yrs',
 'P_800_999_25_34_yrs',
 'P_800_999_35_44_yrs',
 'P_800_999_45_54_yrs',
 'P_800_999_55_64_yrs',
 'P_800_999_65_74_yrs',
 'P_800_999_75_84_yrs',
 'P_800_999_85ov',
 'P_800_999_Tot',
 'P_1000_1249_15_19_yrs',
 'P_1000_1249_20_24_yrs',
 'P_1000_1249_25_34_yrs',
 'P_1000_1249_35_44_yrs',
 'P_1000_1249_45_54_yrs',
 'P_1000_1249_55_64_yrs',
 'P_1000_1249_65_74_yrs',
 'P_1000_1249_75_84_yrs',
 'P_1000_1249_85ov',
 'P_1000_1249_Tot',
 'P_1250_1499_15_19_yrs',
 'P_1250_1499_20_24_yrs',
 'P_1250_1499_25_34_yrs',
 'P_1250_1499_35_44_yrs',
 'P_1250_1499_45_54_yrs',
 'P_1250_1499_55_64_yrs',
 'P_1250_1499_65_74_yrs',
 'P_1250_1499_75_84_yrs',
 'P_1250_1499_85ov',
 'P_1250_1499_Tot',
 'P_1500_1749_15_19_yrs',
 'P_1500_1749_20_24_yrs',
 'P_1500_1749_25_34_yrs',
 'P_1500_1749_35_44_yrs',
 'P_1500_1749_45_54_yrs',
 'P_1500_1749_55_64_yrs',
 'P_1500_1749_65_74_yrs',
 'P_1500_1749_75_84_yrs',
 'P_1500_1749_85ov',
 'P_1500_1749_Tot',
 'P_1750_1999_15_19_yrs',
 'P_1750_1999_20_24_yrs',
 'P_1750_1999_25_34_yrs',
 'P_1750_1999_35_44_yrs',
 'P_1750_1999_45_54_yrs',
 'P_1750_1999_55_64_yrs',
 'P_1750_1999_65_74_yrs',
 'P_1750_1999_75_84_yrs',
 'P_1750_1999_85ov',
 'P_1750_1999_Tot',
 'P_2000_2999_15_19_yrs',
 'P_2000_2999_20_24_yrs',
 'P_2000_2999_25_34_yrs',
 'P_2000_2999_35_44_yrs',
 'P_2000_2999_45_54_yrs',
 'P_2000_2999_55_64_yrs',
 'P_2000_2999_65_74_yrs',
 'P_2000_2999_75_84_yrs',
 'P_2000_2999_85ov',
 'P_2000_2999_Tot',
 'P_3000_3499_15_19_yrs',
 'P_3000_3499_20_24_yrs',
 'P_3000_3499_25_34_yrs',
 'P_3000_3499_35_44_yrs',
 'P_3000_3499_45_54_yrs',
 'P_3000_3499_55_64_yrs',
 'P_3000_3499_65_74_yrs',
 'P_3000_3499_75_84_yrs',
 'P_3000_3499_85ov',
 'P_3000_3499_Tot',
 'P_3500_more_15_19_yrs',
 'P_3500_more_20_24_yrs',
 'P_3500_more_25_34_yrs',
 'P_3500_more_35_44_yrs',
 'P_3500_more_45_54_yrs',
 'P_3500_more_55_64_yrs',
 'P_3500_more_65_74_yrs',
 'P_3500_more_75_84_yrs',
 'P_3500_more_85ov',
 'P_3500_more_Tot',
 'P_PI_NS_15_19_yrs',
 'P_PI_NS_ns_20_24_yrs',
 'P_PI_NS_ns_25_34_yrs',
 'P_PI_NS_ns_35_44_yrs',
 'P_PI_NS_ns_45_54_yrs',
 'P_PI_NS_ns_55_64_yrs',
 'P_PI_NS_ns_65_74_yrs',
 'P_PI_NS_ns_75_84_yrs',
 'P_PI_NS_ns_85_yrs_ovr',
 'P_PI_NS_ns_Tot',
 'P_Tot_15_19_yrs',
 'P_Tot_20_24_yrs',
 'P_Tot_25_34_yrs',
 'P_Tot_35_44_yrs',
 'P_Tot_45_54_yrs',
 'P_Tot_55_64_yrs',
 'P_Tot_65_74_yrs',
 'P_Tot_75_84_yrs',
 'P_Tot_85ov',
 'P_Tot_Tot']

In [37]:
# Remove columns to remove age split & people totals
individual_income = individual_income[['POA_CODE_2021',
 'M_Neg_Nil_income_Tot',
 'M_1_149_Tot',
 'M_150_299_Tot',
 'M_300_399_Tot',
 'M_400_499_Tot',
 'M_500_649_Tot',
 'M_650_799_Tot',
 'M_800_999_Tot',
 'M_1000_1249_Tot',
 'M_1250_1499_Tot',
 'M_1500_1749_Tot',
 'M_1750_1999_Tot',
 'M_2000_2999_Tot',
 'M_3000_3499_Tot',
 'M_3500_more_Tot',
 'M_PI_NS_ns_Tot',
 'F_Neg_Nil_income_Tot',
 'F_1_149_Tot',
 'F_150_299_Tot',
 'F_300_399_Tot',
 'F_400_499_Tot',
 'F_500_649_Tot',
 'F_650_799_Tot',
 'F_800_999_Tot',
 'F_1000_1249_Tot',
 'F_1250_1499_Tot',
 'F_1500_1749_Tot',
 'F_1750_1999_Tot',
 'F_2000_2999_Tot',
 'F_3000_3499_Tot',
 'F_3500_more_Tot',
 'F_PI_NS_ns_Tot']]
individual_income.head()

,POA_CODE_2021,M_Neg_Nil_income_Tot,M_1_149_Tot,M_150_299_Tot,M_300_399_Tot,M_400_499_Tot,M_500_649_Tot,M_650_799_Tot,M_800_999_Tot,M_1000_1249_Tot,...,F_650_799_Tot,F_800_999_Tot,F_1000_1249_Tot,F_1250_1499_Tot,F_1500_1749_Tot,F_1750_1999_Tot,F_2000_2999_Tot,F_3000_3499_Tot,F_3500_more_Tot,F_PI_NS_ns_Tot
0,POA6000,405,93,174,292,241,322,284,406,586,...,386,464,494,422,407,322,498,105,170,656
1,POA6003,60,20,49,63,84,96,85,137,181,...,112,119,172,125,113,89,143,26,42,144
2,POA6004,299,87,130,208,227,262,201,336,451,...,332,357,491,389,352,254,475,103,173,410
3,POA6005,126,36,85,135,115,127,126,158,242,...,170,211,249,210,219,167,294,84,131,176
4,POA6006,213,109,133,221,214,208,169,204,264,...,262,296,334,285,305,251,451,110,185,173

In [38]:
# Merge the three CSVs

median_household_income = pd.merge(median_income,household_income,on="POA_CODE_2021")
median_household_income = pd.merge(median_household_income,individual_income,on="POA_CODE_2021")
median_household_income.head()

,POA_CODE_2021,Median_age_persons,Median_tot_prsnl_inc_weekly,Median_tot_fam_inc_weekly,Median_tot_hhd_inc_weekly,Negative_Nil_income_Tot,HI_1_149_Tot,HI_150_299_Tot,HI_300_399_Tot,HI_400_499_Tot,...,F_650_799_Tot,F_800_999_Tot,F_1000_1249_Tot,F_1250_1499_Tot,F_1500_1749_Tot,F_1750_1999_Tot,F_2000_2999_Tot,F_3000_3499_Tot,F_3500_more_Tot,F_PI_NS_ns_Tot
0,POA6182,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,POA6067,33,341,850,849,0,0,0,0,0,...,3,0,0,0,0,0,0,0,0,0
2,POA6770,29,367,794,1066,0,8,38,35,63,...,35,52,59,41,42,20,39,9,0,201
3,POA6718,34,368,1006,1074,0,0,9,8,16,...,15,11,14,11,6,3,15,0,0,42
4,POA6765,31,386,863,1226,0,5,21,22,28,...,19,22,38,34,29,18,31,0,0,71

In [39]:
# Review columns for relevance
list(median_household_income.columns)

['POA_CODE_2021',
 'Median_age_persons',
 'Median_tot_prsnl_inc_weekly',
 'Median_tot_fam_inc_weekly',
 'Median_tot_hhd_inc_weekly',
 'Negative_Nil_income_Tot',
 'HI_1_149_Tot',
 'HI_150_299_Tot',
 'HI_300_399_Tot',
 'HI_400_499_Tot',
 'HI_500_649_Tot',
 'HI_650_799_Tot',
 'HI_800_999_Tot',
 'HI_1000_1249_Tot',
 'HI_1250_1499_Tot',
 'HI_1500_1749_Tot',
 'HI_1750_1999_Tot',
 'HI_2000_2499_Tot',
 'HI_2500_2999_Tot',
 'HI_3000_3499_Tot',
 'HI_3500_3999_Tot',
 'HI_4000_more_Tot',
 'Partial_income_stated_Tot',
 'All_incomes_not_stated_Tot',
 'Tot_Family_households',
 'Tot_Non_family_households',
 'M_Neg_Nil_income_Tot',
 'M_1_149_Tot',
 'M_150_299_Tot',
 'M_300_399_Tot',
 'M_400_499_Tot',
 'M_500_649_Tot',
 'M_650_799_Tot',
 'M_800_999_Tot',
 'M_1000_1249_Tot',
 'M_1250_1499_Tot',
 'M_1500_1749_Tot',
 'M_1750_1999_Tot',
 'M_2000_2999_Tot',
 'M_3000_3499_Tot',
 'M_3500_more_Tot',
 'M_PI_NS_ns_Tot',
 'F_Neg_Nil_income_Tot',
 'F_1_149_Tot',
 'F_150_299_Tot',
 'F_300_399_Tot',
 'F_400_499_Tot',
 'F_500_649_Tot',
 'F_650_799_Tot',
 'F_800_999_Tot',
 'F_1000_1249_Tot',
 'F_1250_1499_Tot',
 'F_1500_1749_Tot',
 'F_1750_1999_Tot',
 'F_2000_2999_Tot',
 'F_3000_3499_Tot',
 'F_3500_more_Tot',
 'F_PI_NS_ns_Tot']

In [40]:
# Remove POA from Postcode number

median_household_income["POA_CODE_2021"]=median_household_income["POA_CODE_2021"].str[3:]
median_household_income.head()

,POA_CODE_2021,Median_age_persons,Median_tot_prsnl_inc_weekly,Median_tot_fam_inc_weekly,Median_tot_hhd_inc_weekly,Negative_Nil_income_Tot,HI_1_149_Tot,HI_150_299_Tot,HI_300_399_Tot,HI_400_499_Tot,...,F_650_799_Tot,F_800_999_Tot,F_1000_1249_Tot,F_1250_1499_Tot,F_1500_1749_Tot,F_1750_1999_Tot,F_2000_2999_Tot,F_3000_3499_Tot,F_3500_more_Tot,F_PI_NS_ns_Tot
0,6182,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,6067,33,341,850,849,0,0,0,0,0,...,3,0,0,0,0,0,0,0,0,0
2,6770,29,367,794,1066,0,8,38,35,63,...,35,52,59,41,42,20,39,9,0,201
3,6718,34,368,1006,1074,0,0,9,8,16,...,15,11,14,11,6,3,15,0,0,42
4,6765,31,386,863,1226,0,5,21,22,28,...,19,22,38,34,29,18,31,0,0,71

In [41]:
median_household_income.columns= median_household_income.columns.str.lower()
median_household_income.head()

,poa_code_2021,median_age_persons,median_tot_prsnl_inc_weekly,median_tot_fam_inc_weekly,median_tot_hhd_inc_weekly,negative_nil_income_tot,hi_1_149_tot,hi_150_299_tot,hi_300_399_tot,hi_400_499_tot,...,f_650_799_tot,f_800_999_tot,f_1000_1249_tot,f_1250_1499_tot,f_1500_1749_tot,f_1750_1999_tot,f_2000_2999_tot,f_3000_3499_tot,f_3500_more_tot,f_pi_ns_ns_tot
0,6182,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,6067,33,341,850,849,0,0,0,0,0,...,3,0,0,0,0,0,0,0,0,0
2,6770,29,367,794,1066,0,8,38,35,63,...,35,52,59,41,42,20,39,9,0,201
3,6718,34,368,1006,1074,0,0,9,8,16,...,15,11,14,11,6,3,15,0,0,42
4,6765,31,386,863,1226,0,5,21,22,28,...,19,22,38,34,29,18,31,0,0,71

In [42]:
output_csv='Output/income_data.csv'

median_household_income.to_csv(output_csv,header=True,index=True)

In [43]:
median_household_income.to_sql(name='Median Income', con=engine, if_exists='append', index=False)

384